{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_2",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": 42
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.01
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true,
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.1,
            "name": "leaky_re_lu_LeakyReLU3",
            "trainable": true
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization3",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.2,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": 42
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.01
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense5",
            "trainable": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.1,
            "name": "leaky_re_lu_LeakyReLU4",
            "trainable": true
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization4",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": 42
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense6",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 3.11.0",
    "backend": "tensor_flow.js"
  },
  "weightSpecs": [
    {
      "name": "dense_Dense4/kernel",
      "shape": [
        4,
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense4/bias",
      "shape": [
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization3/gamma",
      "shape": [
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization3/beta",
      "shape": [
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense5/kernel",
      "shape": [
        8,
        4
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense5/bias",
      "shape": [
        4
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization4/gamma",
      "shape": [
        4
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization4/beta",
      "shape": [
        4
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense6/kernel",
      "shape": [
        4,
        1
      ],
      "dtype": "float32"
    },
    {
      "name": "dense_Dense6/bias",
      "shape": [
        1
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization3/moving_mean",
      "shape": [
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization3/moving_variance",
      "shape": [
        8
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization4/moving_mean",
      "shape": [
        4
      ],
      "dtype": "float32"
    },
    {
      "name": "batch_normalization_BatchNormalization4/moving_variance",
      "shape": [
        4
      ],
      "dtype": "float32"
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v3.11.0",
  "convertedBy": null
}